In [1]:
import pandas as pd

In [2]:
#EX1
df=pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})

In [146]:
#EX2
import numpy as np
df3=pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']},index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [12]:
#EX3: Display a summary of the basic information
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [13]:
#EX4: Get the first 3 rows of a given DataFrame
df3.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [15]:
#EX5: Select the 'name' and 'score' columns
df3[['name','score']].head(3)

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5

In [22]:
#EX6: Select the specified columns and rows from a given data frame
df3.loc[['b','d','f','g'],['name','score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [25]:
#EX7: Select the rows where the number of attempts in 
#the examination is greater than 2.
df3[df3['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [28]:
#EX8: count the number of rows and columns of a DataFrame
print('Number of rows: ',len(df3.name))
print('Number of columns: ',len(list(df3.columns)))

Number of rows:  10
Number of columns:  4

In [34]:
#EX9: Select the rows where the score is missing
df3[df3['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [39]:
#EX10: Select the rows the score is between 15 and 20 
df3[(15<=df3['score']) & (df3['score']<=20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [41]:
#EX11: select the rows where number of attempts in the examination 
#      is less than 2 and score greater than 15
df3[(2>df3['attempts']) & (df3['score']>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [45]:
#EX12: Change the score in row 'd' to 11.5
df.loc['d','score']=11.5
df.head(4)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no

In [46]:
#EX13: calculate the sum of the examination attempts
df3['attempts'].sum()

19

In [47]:
#EX14: mean score
df3['score'].mean()

13.5625

In [61]:
#EX15: Append a new row 'k' to data frame with given values for 
#      each column. Now delete the new row and return the original 
new=pd.DataFrame({'name':'Jihwan','score':100,'attempts':4
                  ,'qualify':'yes'},index=['k'])
df3=pd.concat([df3,new])
df3.drop(['k'],inplace=True)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [68]:
#EX16: Sort the DataFrame first by 'name' in descending order, 
#      then by 'score' in ascending order.
df3.sort_values(by=['name','score'],ascending=[False,True])
df3

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [82]:
#EX17: Replace the 'qualify' column contains the values 'yes' and 
#     'no' with True and False
df3['qualify']=df3['qualify'].map({'yes':True,'no':False})
df3

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [86]:
#EX18: Change the name 'James' to 'Suresh' in name column
df3['name']=df3['name'].replace('James','Suresh')
df3.head(4)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no

In [89]:
#EX19: Delete the 'attempts' column
df3.drop(['attempts'],axis=1,inplace=True)
df3

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d     Suresh    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

In [91]:
#EX20: Insert a new column in existing DataFrame
df3['color']=['Red','Green','White','Black','Purple','Brown','Gray','Pink','Gray','Pink']
df3

        name  score qualify   color
a  Anastasia   12.5     yes     Red
b       Dima    9.0      no   Green
c  Katherine   16.5     yes   White
d     Suresh    NaN      no   Black
e      Emily    9.0      no  Purple
f    Michael   20.0     yes   Brown
g    Matthew   14.5     yes    Gray
h      Laura    NaN      no    Pink
i      Kevin    8.0      no    Gray
j      Jonas   19.0     yes    Pink

In [94]:
#EX21: Iterate over rows
for i,row in df3.iterrows():
    print(row['name'],row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
Suresh nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

In [99]:
#EX 22: get list from DataFrame column headers
list(df3.columns)

['name', 'score', 'qualify', 'color']

In [105]:
#EX 23: rename columns
df2={'col1':[1,2,3],'col2':[1,2,3],'col3':[1,2,3]}
df2=pd.DataFrame(df2,index=['a','b','c'])
df2=df2.rename(columns={'col1':'c1','col2':'c2','col3':'c3'})
df2

   c1  c2  c3
a   1   1   1
b   2   2   2
c   3   3   3

In [126]:
#EX24: Select rows from a given DataFrame based on values 
#      in some columns
df2={'col1':[0, 1, 4, 7],'col2':[7,1,2,3],'col3':[6,1,2,3]}
df2=pd.DataFrame(df2)
df2[df2['col2']==2]

   col1  col2  col3
2     4     2     2

In [107]:
#EX 25: Change the order of a DataFrame columns
df2=df2[['col2','col1','col3']]
df2

   col2  col1  col3
0     7     0     6
1     1     1     1
2     2     4     2
3     3     7     3

In [111]:
#EX 26: Add one row in an existing DataFrame
df2=df2[['col1','col2','col3']]
new_row={'col1':1,'col2':2,'col3':12}
df2=df2.append(new_row,ignore_index=True)
df2

   col1  col2  col3
0     0     7     6
1     1     1     1
2     4     2     2
3     7     3     3
4     1     2    12

In [114]:
#EX 27: Write a DataFrame to CSV file using tab separator
df2.to_csv('new_csv.csv',sep='\t')
new_df=pd.read_csv('new_csv.csv')
new_df

  \tcol1\tcol2\tcol3
0         0\t0\t7\t6
1         1\t1\t1\t1
2         2\t4\t2\t2
3         3\t7\t3\t3
4        4\t1\t2\t12

In [125]:
#EX 28: Count city wise number of people from a given of data set
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
df1.groupby(['city']).size().reset_index(name='Number of people')

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [128]:
#EX 29: delete DataFrame row(s) based on given column value
df2[df2['col2']!=2]

   col1  col2  col3
0     0     7     6
1     1     1     1
3     7     3     3

In [135]:
#EX 31: select a row of series/dataframe by given integer index
df2.iloc[[3,]]

   col1  col2  col3
3     7     3     3

In [137]:
# EX 32: replace all the NaN values with Zero's in a column
df3.fillna(0)

        name  score qualify   color
a  Anastasia   12.5     yes     Red
b       Dima    9.0      no   Green
c  Katherine   16.5     yes   White
d     Suresh    0.0      no   Black
e      Emily    9.0      no  Purple
f    Michael   20.0     yes   Brown
g    Matthew   14.5     yes    Gray
h      Laura    0.0      no    Pink
i      Kevin    8.0      no    Gray
j      Jonas   19.0     yes    Pink

In [139]:
#EX 33: convert index in a column
df3.reset_index()

  index       name  score qualify   color
0     a  Anastasia   12.5     yes     Red
1     b       Dima    9.0      no   Green
2     c  Katherine   16.5     yes   White
3     d     Suresh    NaN      no   Black
4     e      Emily    9.0      no  Purple
5     f    Michael   20.0     yes   Brown
6     g    Matthew   14.5     yes    Gray
7     h      Laura    NaN      no    Pink
8     i      Kevin    8.0      no    Gray
9     j      Jonas   19.0     yes    Pink

In [155]:
#EX 34: Set a given value for particular cell
df3=pd.DataFrame(df3)
df3.at['i','score']=10.2
df3

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d      James    NaN       3.0      no
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin   10.2       2.0      no
j      Jonas   19.0       1.0     yes

In [159]:
#EX 35: count the NaN values
df3.isnull().sum()

name        0
score       2
attempts    0
qualify     0
dtype: int64

In [161]:
#EX 36: drop a list of rows
df3.drop(['a','c'])

      name  score  attempts qualify
b     Dima    9.0       3.0      no
d    James    NaN       3.0      no
e    Emily    9.0       2.0      no
f  Michael   20.0       3.0     yes
g  Matthew   14.5       1.0     yes
h    Laura    NaN       1.0      no
i    Kevin   10.2       2.0      no
j    Jonas   19.0       1.0     yes

In [164]:
#EX 37: Reset index after removing some rows
df3.drop(['a','c'],inplace=True)
df3.reset_index()

  index     name  score  attempts qualify
0     b     Dima    9.0       3.0      no
1     d    James    NaN       3.0      no
2     e    Emily    9.0       2.0      no
3     f  Michael   20.0       3.0     yes
4     g  Matthew   14.5       1.0     yes
5     h    Laura    NaN       1.0      no
6     i    Kevin   10.2       2.0      no
7     j    Jonas   19.0       1.0     yes

In [166]:
#EX 38: divide a DataFrame in a given ratio
df2/2

   col1  col2  col3
0   0.0   3.5   3.0
1   0.5   0.5   0.5
2   2.0   1.0   1.0
3   3.5   1.5   1.5

In [172]:
#EX39: combining two series into a DataFrame
s1=pd.Series([1,2,3],index=['a','b','c'])
s2=pd.Series([3,4,5],index=['a','b','c'])
s3=pd.concat([s1,s2],axis=1)
s3

   0  1
a  1  3
b  2  4
c  3  5

In [174]:
#EX 40: shuffle a given DataFrame rows
df3.sample(frac=1)

      name  score  attempts qualify
g  Matthew   14.5       1.0     yes
i    Kevin   10.2       2.0      no
e    Emily    9.0       2.0      no
b     Dima    9.0       3.0      no
j    Jonas   19.0       1.0     yes
f  Michael   20.0       3.0     yes
h    Laura    NaN       1.0      no
d    James    NaN       3.0      no

In [188]:
#EX 41: convert DataFrame column type from string to datetime
series=pd.Series(['3/11/2000','3/12/2000','3/13/2000'])
series=pd.to_datetime(series)
series

0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

In [193]:
#EX 42: rename a specific column name
df2=df2.rename(columns={'col1':'c1'})
df2

   c1  col2  col3
0   0     7     6
1   1     1     1
2   4     2     2
3   7     3     3

In [194]:
#EX 43: get a list of a specified column
list(df2['col2'])

[7, 1, 2, 3]

In [199]:
#EX 44: Create a DataFrame from a Numpy array and specify the index 
#       column and column headers
data=pd.DataFrame(np.zeros([4,4]),index=['a','b','c','d'],columns=['a','b','c','d'])
data

     a    b    c    d
a  0.0  0.0  0.0  0.0
b  0.0  0.0  0.0  0.0
c  0.0  0.0  0.0  0.0
d  0.0  0.0  0.0  0.0

In [204]:
#EX 45: find the row where the value of a given column is maximum
for col in df2.columns:
    row=list(df2[col]).index(max(df2[col]))
    print('Row where ',col,' has maximum value: ',row)

Row where  c1  has maximum value:  3
Row where  col2  has maximum value:  0
Row where  col3  has maximum value:  0

In [206]:
#EX 46: check whether a given column is present in a DataFrame or not
colname='col4'
if colname not in df2.columns:
    print(colname,' is not present in DataFrame.')
else:
    print(colname,' is present in DataFrame.')

col4  is not present in DataFrame.

In [208]:
#EX 47: get the specified row value of a given DataFrame
df2.iloc[1,:]

c1      1
col2    1
col3    1
Name: 1, dtype: int64

In [210]:
#EX 48: get the datatypes of columns of a DataFrame
df3.dtypes

name         object
score       float64
attempts    float64
qualify      object
dtype: object

In [212]:
#EX 49: append data to an empty DataFrame
empty_df=pd.DataFrame({})
non_empty=empty_df.append(df3)
non_empty.head(3)

    name  score  attempts qualify
b   Dima    9.0       3.0      no
d  James    NaN       3.0      no
e  Emily    9.0       2.0      no

In [215]:
#EX 50: sort a given DataFrame by two or more columns
df3.sort_values(by=['attempts','score'])

      name  score  attempts qualify
g  Matthew   14.5       1.0     yes
j    Jonas   19.0       1.0     yes
h    Laura    NaN       1.0      no
e    Emily    9.0       2.0      no
i    Kevin   10.2       2.0      no
b     Dima    9.0       3.0      no
f  Michael   20.0       3.0     yes
d    James    NaN       3.0      no

In [220]:
#EX 51: convert the datatype of a given column (floats to ints)
df3.attempts=df3.attempts.astype(int)
df3.attempts.dtypes

dtype('int64')

In [224]:
#EX 52: remove infinite values from a given DataFrame
series=pd.Series([100,10000,100,float('infinity')])
series=series.replace(float('infinity'),np.nan)
series

0      100.0
1    10000.0
2      100.0
3        NaN
dtype: float64

In [228]:
#EX 53: insert a given column at a specific column index
df2['c0']=[1,2,3,4]
df2=df2[['c0','c1','col2','col3']]
df2

   c0  c1  col2  col3
0   1   1     7     6
1   2   2     1     1
2   3   3     2     2
3   4   4     3     3

In [229]:
#EX 54: convert a given list of lists into a Dataframe
arr=[[2, 4], [1, 3]]
arr=np.array(arr)
df4=pd.DataFrame(arr)
df4

   0  1
0  2  4
1  1  3

In [251]:
#EX 55: group by the first column and get second column 
#       as lists in rows
df = pd.DataFrame({'col1':['C1','C1','C2','C2','C2','C3','C2'],
                   'col2':[1,2,3,3,4,6,5]})
df.groupby('col1').col2.apply(list)

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

In [239]:
#EX 56: get column index from column name
collist=list(df.columns)
collist.index('col1')

0

In [240]:
#EX 57: count number of columns
len(list(df.columns))

2

In [252]:
#EX 58: Select all columns, except one given column
df.drop(['col1'],axis=1,inplace=True)
df.head(2)

   col2
0     1
1     2

In [254]:
#EX 59: get first n records
df.iloc[:3,:]

   col2
0     1
1     2
2     3

In [255]:
#EX 60: get last n records
df.iloc[3:,:]

   col2
3     3
4     4
5     6
6     5

In [262]:
#EX 61: get topmost n records within each group
df2.sort_values(by=['c0'],ascending=False).iloc[:2,:]

   c0  c1  col2  col3
3   4   4     3     3
2   3   3     2     2

In [267]:
#EX 62: remove first n rows
df2.drop([0,1],axis=0)

   c0  c1  col2  col3
2   3   3     2     2
3   4   4     3     3

In [269]:
#EX 63: remove last n rows
df2.drop([2,3],axis=0)

   c0  c1  col2  col3
0   1   1     7     6
1   2   2     1     1

In [270]:
#EX 64: add a prefix or suffix to all columns
df2.add_prefix('A_')

   A_c0  A_c1  A_col2  A_col3
0     1     1       7       6
1     2     2       1       1
2     3     3       2       2
3     4     4       3       3

In [279]:
#EX 65: reverse order (rows, columns)
df2.iloc[::-1,:]
df2.iloc[:,::-1]

   col3  col2  c1  c0
0     6     7   1   1
1     1     1   2   2
2     2     2   3   3
3     3     3   4   4

In [290]:
#EX 66: select columns by data type
cols=df3.columns
for col in cols:
    if df3[col].dtypes==int:
        print(df3[col])

b    3
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: attempts, dtype: int64

In [303]:
#EX 67: split a given DataFrame into two random subsets
df3_1=df3.sample(frac=0.5)
df3_2=df3.drop(df3_1.index)